Revit 2027 API
ViewSchedule.GetDefaultNameForKeynoteLegend Method
 Gets the default view name that will be used when creating a keynote legend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetDefaultNameForKeynoteLegend(
	Document document
)
Public Shared Function GetDefaultNameForKeynoteLegend (
	document As Document
) As String
public:
static String^ GetDefaultNameForKeynoteLegend(
	Document^ document
)
static member GetDefaultNameForKeynoteLegend :
        document : Document -> string
Parameters
document Document
 The document to which the new schedule will be added.
Return Value
String
 The default view name.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace